{
    "modal logics": "Differently from classical logic, modal logic entertains the idea that the truth of a proposition can vary depending on the context or world in which it is evaluated.",
    "semantics": "The study of meaning in language. It examines how words, phrases, and sentences convey meaning.",
    "definite description": "Phrase of the form 'the X', where X is a noun phrase or a singular commun noun. It is <em>proper</em> if it refers to a specific object or individual (like \"the first person in space\"), and <em>improper</em> if it refers to a class of objects or individuals (\"like the French genereal\").",
    "International Monetary Fund": "An international organization that works to foster global monetary cooperation and financial stability. It provides advice and technical assistance to member countries, and also makes loans to countries facing balance of payments problems",
    "World Bank": "An international financial institution that provides loans and grants to the governments of low- and middle-income countries for the purposes of economic development.",
    "Bolshevik": "The Bolsheviks, led by Vladimir Lenin, were a radical faction of the Marxist Russian Social Democratic Labour Party (RSDLP). Its ideology, based on Leninist and later Marxist–Leninist principles, became known as Bolshevism.",
    "commodities": "Basic goods used in commerce that are interchangeable with other goods of the same type. Commodities are often raw materials or primary agricultural products that can be bought and sold, such as gold, oil, or wheat.",
    "surplus value": "The difference between the value produced by labor and the actual wage paid to labor. It is a key concept in understanding how capitalists profit from the labor of workers.",
    "commodity fetishism": "The perception of the economic relationships of production and exchange as relationships among things (money and merchandise) rather than among people.",
    "psychoanalysis": "A therapeutic approach that aims to explore the unconscious mind and its influence on behavior. It was developed by Sigmund Freud and involves techniques such as free association, dream analysis, and transference.",
    "tar-water": "A medicinal concoction made from pine tar and water formerly regarded as a cure-all.",
    "phenomena and noumena": "In Kantian philosophy, phenomena are what we experience, while noumena are the underlying reality that is not directly accessible to us.",
    "aesthetics": "The branch of philosophy concerned with the nature of beauty and taste. It explores how we perceive and appreciate art, nature, and other forms of expression.",
    "metaphysics": "The branch of philosophy that deals with the first principles of things, including abstract concepts such as being, knowing, substance, cause, identity, time, and space.",
    "epistemology": "The study of knowledge, its nature, sources, limitations, and validity. It addresses questions about belief, truth, and justification.",
    "ontology": "A branch of metaphysics that deals with the nature of being and existence. It explores concepts such as objects, properties, space, time, and causality.",
    "ethics": "The branch of philosophy that deals with moral principles and values. It examines what is right and wrong, good and bad, and how individuals should act in various situations.",
    "hermeneutics": "The theory and methodology of interpretation, especially the interpretation of biblical texts, wisdom literature, and philosophical texts.",
    "deconstruction": "A set of approaches that questions the fundamental conceptual distinctions, or \"oppositions,\" in Western philosophy through a close examination of the language and logic of philosophical and literary texts.",
    "existentialism": "A family of philosophical movements mainly historically situated against the backdrop of the Second World War, which emphasizes individual existence, freedom, and choice. It explores the meaning of life and the individual's role in a seemingly indifferent or absurd universe.",
    "post-structuralism": "A movement in literary criticism and philosophy that held that language is not a transparent medium that connects one directly with a \"truth\" or \"reality\" outside it but rather a structure or code, whose parts derive their meaning from their contrast with one another and not from any connection with an outside world.",
    "scholastic": "Scholasticism was a medieval school of philosophy that sought to reconcile faith and reason, often using dialectical reasoning to address theological and philosophical questions. It was characterized by a systematic approach to learning and a focus on the works of Aristotle.",
    "scholasticism": "Scholasticism was a medieval school of philosophy that sought to reconcile faith and reason, often using dialectical reasoning to address theological and philosophical questions. It was characterized by a systematic approach to learning and a focus on the works of Aristotle.",
    "archetype": "The original pattern or model of which all things of the same type are representations or copies. In psychology, it refers to universal symbols or themes that recur across cultures and time periods, often found in myths, dreams, and literature.",
    "St. Augustine": "Augustine of Hippo (354 - 430) was a theologian and philosopher of the Patristic period and a foundational figure in Western Christianity. His works, such as 'Confessions' and 'The City of God,' explore themes of faith, free will, and the nature of God.",
    "Oratorian": "The Congregation of the Oratory of Jesus and Mary Immaculate is a society of apostolic life of Catholic priests founded in 1611 in Paris, France, by cardinal Pierre de Bérulle.",
    "pineal gland": "A small endocrine gland located near the center of the brain, between the two hemispheres. It produces melatonin, a hormone which modulates sleep patterns.",
    "Franz Brentano": "A German philosopher and psychologist credited with founding a form of psychotherapy known as act psychology. He emphasized the importance of intentionality in mental acts, meaning that all mental phenomena are directed towards an object.",
    "Carl Stumpf": "A German philosopher, psychologist and musicologist who is known for his work in the philosophy of music and the psychology of perception.",
    "Alexander the Great": "An ancient Macedonian king from 336 to 323 BC, known for his military conquests and for the spreading of Greek culture onto Asia and Egypt.",
    "eudaimonia": "A condition happiness or well-being, attained through living a life of virtue and fulfilling one's potential.",
    "teleology": "The study of reasons or purposes as a means of explaining phenomena, as opposed to the study of its causes.",
    "Islamic Golden Age": "A period of scientific, economic, and cultural flourishing in the history of Islam, traditionally dated from the 8th century to the 13th century.",
    "Peripatetic school": "An ancient Greek institution founded by Aristotle in Athens, whose members were known for walking about while discussing philosophical topics. It is named after the peripatoi ('walkways', some covered or with colonnades) of the Lyceum, where members met.",
    "Lyceum": "A temple in Athens dedicated to Apollo Lyceus (\"Apollo the wolf-god\"). While most often connected with philosophical teaching and discourse, the Lyceum was used for military exercises, meetings of the Athenian assembly, and cult practice as well as athletic training.",
    "Thomas Aquinas": "Thomas Aquinas (1225 – 1274) was an Italian Dominican friar and priest and foremost scholastic thinker. He is known for his synthesis of Aristotelian philosophy with Christian theology, particularly in his works 'Summa Theologica' and 'Summa Contra Gentiles'.",
    "Moerbeke": "William of Moerbeke (1215 – 1286) was a Flemish Dominican friar and translator of philosophical, medical, and scientific texts from Greek into Latin. He translated many of Aristotle's texts from Greek to Latin, making them accessible to medieval scholars.",
    "Maupertuis": "Pierre Louis Moreau de Maupertuis (1698 - 1759) was a French mathematician, physicist and philosopher. He is known for the principle of least action in physics, which states that the path taken by a system between two states is the one for which the action is minimized.",
    "Cave": "Plato's Allegory of the Cave, from his work The Republic, uses the metaphor of prisoners chained in a cave, only able to see shadows on the wall, to illustrate the nature of knowledge and truth. These shadows are perceived as reality by the prisoners, while a single prisoner is eventually freed, escapes the cave, and discovers the true world outside, full of real objects and the sun. The freed prisoner, upon returning to the cave, is blinded by the sudden light and ridiculed for his new knowledge, which highlights the difficulty of sharing enlightenment with those who are unaccustomed to it",
    "consumption function": "A formula that expresses the relationship between consumption and disposable income. It shows how much households are willing to consume at different levels of income, indicating that as income increases, consumption also tends to increase, but not necessarily at the same rate.",
    "marginal propensity to consume": "The proportion of additional income that a household consumes rather than saves. It is a key concept in Keynesian economics, indicating how much of an increase in income will be spent on consumption.",
    "multiplier effect": "The concept that an initial change in spending (such as government expenditure) will lead to a larger overall increase in economic activity. This occurs because the initial spending creates income for others, who then spend a portion of that income, leading to further rounds of spending and income generation.",
    "historicism": "An approach to understanding social and cultural phenomena by studying the process or history by which they came about.",
    "utopianism": "A general label for a number of different ways of dreaming or thinking about, describing or attempting to create a better society.",
    "open societies": "A term coined by philosopher Henri Bergson, referring to a society characterized by the acceptance of differences and the application of uniform rules and standards across all members of the population. It contrasts with closed societies that are religiously, culturally, economically or polically segregating.",
    "Jean-Paul Sartre": "Jean-Paul Charles Aymard Sartre (1905 - 1980) was a French philosopher, playwright, novelist, screenwriter, political activist, biographer, and literary critic, considered a leading figure in 20th-century French philosophy and Marxism. He is best known for his existentialist works, including 'Being and Nothingness' and 'Existentialism is a Humanism', where he explores themes of freedom, responsibility, and the nature of existence.",
    "Simone de Beauvoir": "Simone Lucie Ernestine Marie Bertrand de Beauvoir (1908 - 1986) was a French existentialist philosopher, feminist activist, and social theorist. She is best known for her book 'The Second Sex',  a detailed analysis of women's oppression and a foundational tract of contemporary feminism. ",
    "ataraxia": "Generally translated as 'tranquility' or 'unperturbedness', it is a lucid state of robust equanimity characterized by ongoing freedom from distress and worry.",
    "aponia": "Absence of pain, both physical and mental.",
    "Liar Paradox": "A self-referential paradox that arises when a statement refers to itself in a way that creates a contradiction. The classic example is the statement 'This statement is false.' If it is true, then it must be false, and if it is false, then it must be true.",
    "Euripides": "Euripides (c. 480 - 406) was a Greek tragedian of classical Athens. Along with Aeschylus and Sophocles, he is one of the three ancient Greek tragedians for whom any plays have survived in full.",
    "Pericles": "Pericles (c. 495 - 429 BC) was a prominent and influential statesman, orator, and general during Athens' Golden Age. He played a key role in the development of Athenian democracy, and led Athens during the early part of the Peloponnesian War.",
    "Peloponnese": "A peninsula in southern Greece, which was the site of many significant events in ancient Greek history, including the Peloponnesian War between Athens and Sparta.",
    "Porphyry": "Porphyry of Tyre (c. 234 - c. 305) was a Neoplatonist philosopher and student of Plotinus born in Tyre, Roman Phoenicia. He is known for his works on logic, metaphysics, and ethics, as well as for his introduction to the philosophy of Plotinus, 'The Enneads'.",
    "Stoa Poikile": "The Stoa Poikile, or 'Painted Porch', was a Doric stoa (covered walkway) erected around 460 BC in the Agora of Athens. It was decorated with four famous paintings depicting the Battle of Marathon, the Battle at Oenoe, the Sack of Troy and the Amazonomachy, among others.",
    "Five Good Emperors": "A term used to describe the five Roman emperors who ruled from 96 to 180 AD: Nerva, Trajan, Hadrian, Antoninus Pius, and Marcus Aurelius. This period is often considered a high point in Roman history due to its relative peace and prosperity.",
    "Emperor Nero": "Nero Claudius Caesar Augustus Germanicus (37 - 68) was the last Roman emperor of the Julio-Claudian dynasty. His rule is often associated with tyranny, extravagance, and the Great Fire of Rome in 64 AD.",
    "Dominican": "The Order of Preachers, commonly known as the Dominican Order, is a mendicant Catholic religious order founded by Saint Dominic de Guzmán in the 13th century. The order's primary focus is preaching and combating heresy through education, scholarship, and pastoral work.",
    "cathedral school": "Cathedral schools began in the Early Middle Ages as centers of advanced education run by the cathedral clergy. Originally the function of such schools was to train priests, but later they taught lay students as well — usually boys of noble families being prepared for high positions in church, state, or commercial affairs.",
    "patristic": "Patristics is a branch of theological studies focusing on the writings of the Church Fathers, Christian leaders and theologians in the early Christian Church who shaped Christian doctrine and practice.",
    "sacraments": "Christian rites believed to have been ordained by Christ and that are considered to be a means of divine grace or to be a sign or symbol of a spiritual reality.",
    "canon law": "Body of laws made within certain Christian churches by lawful ecclesiastical authority for the government both of the whole church and parts thereof and of the behavior and actions of individuals.",
    "seven sacraments": "In Catholicism, the seven sacraments are Baptism, Confirmation, Eucharist, Penance (Confession), Anointing of the Sick, Holy Orders, and Matrimony.",
    "soteriology": "A branch of theology that focuses on the study of salvation. It explores the nature and process of salvation, including who is saved, by whom, from what, and by what means.",
    "Cappadocian Fathers": "The Cappadocian Fathers were three early Christian theologians: Basil the Great, Gregory of Nyssa, and Gregory of Nazianzus, who lived in the 4th century AD. They are primarily known for their significant contributions to shaping the doctrine of the Trinity and their influence on Eastern Christianity.",
    "inquisition": "Various medieval and reformation-era state-organized tribunals whose aim was to combat heresy, apostasy, blasphemy, witchcraft, and customs considered to be deviant.  Violence, isolation, torture or the threat of its application, have been used by the Inquisition to extract confessions and denunciations.",
    "Sephardic": "Sephardic Jews are a Jewish diaspora population associated with the historic Jewish communities of the Iberian Peninsula and their descendants.",
    "Enlightenment": "An intellectual and philosophical movement taking place in Europe from the late 17th century to the early 19th century. It emphasized knowledge gained through rationalism and empiricism, and was concerned with a range of social and political ideals such as natural law, liberty, and progress, toleration and fraternity and constitutional governments.",
    "Kabbalah": "A mystical and esoteric interpretation of Jewish religious texts, particularly the Torah. It seeks to understand the nature of God, the universe, and the soul through symbolic and allegorical interpretations.",
    "Johann Reuchlin": "Johann Reuchlin (1455 - 1522) was a German catholic humanist and scholar of Greek and Hebrew whose defense of Hebrew literature helped awaken liberal intellectual forces in the years immediately preceding the Reformation.",
    "Erasmus": "Desiderius Erasmus Roterodamus (1466 - 1536) was a Dutch Renaissance humanist, Catholic priest, social critic, teacher, and theologian. He is best known for his works on Christian humanism, including 'In Praise of Folly' and his critical edition of the New Testament.",
    "Xenophon": "Xenophon (c. 430 - c. 354 BC) was an ancient Greek historian, philosopher, and soldier. He is best known for his works 'Anabasis', which recounts his journey with Greek mercenaries through Persia, and 'Memorabilia', a collection of Socratic dialogues that provide insight into the life and teachings of Socrates.",
    "Aristophanes": "Aristophanes (c. 446 - c. 386 BC) was a comic playwright of ancient Athens, known for his satirical and often politically charged plays. His works, such as 'Lysistrata', 'The Clouds', and 'The Frogs', provide valuable insights into Athenian society, politics, and culture during the 5th century BC.",
    "Andalusian": "Andalusia is the southernmost autonomous community in Peninsular Spain, located in the south of the Iberian Peninsula, in southwestern Europe.",
    "al‑Ghazālī’s": "Abu Hamid al-Ghazali (1058 - 1111) was a Persian theologian, jurist, philosopher, and mystic who played a significant role in the development of Islamic philosophy and theology. His works, such as 'The Incoherence of the Philosophers', critiqued the rationalist philosophers of his time and sought to reconcile Islamic faith with Sufism.",
    "Almohads": "The Almohad Caliphate was a North African Berber Muslim empire founded in the 12th century. At its height, it controlled much of the Iberian Peninsula and North Africa.",
    "aporia": "In philosophy, a conundrum or state of puzzlement. It refers to a situation where one is faced with a seemingly insoluble problem or an impasse in reasoning, often leading to a deeper exploration of the issue at hand.",
    "Euthyphro Dilemma": "A philosophical question posed by Plato in the dialogue 'Euthyphro', which asks whether something is good because God commands it, or if God commands it because it is good. This dilemma raises questions about the nature of morality and the relationship between divine authority and ethical principles.",
    "hemlock": "A highly poisonous flowering plant native to Europe and North Africa.",
    "Christology": "The branch of Christian theology that studies the nature, person, and works of Jesus Christ. It addresses questions about the divinity and humanity of Christ, his role in salvation, and his relationship with God.",
    "Trinity": "The Christian doctrine of the Trinity holds that God exists as three distinct persons: the Father, the Son (Jesus Christ), and the Holy Spirit, who are all fully and equally God, yet one in essence.",
    "Theon": "Theon of Alexandria (335 - 405) was a Greek scholar and mathematician who played a significant role in the preservation and transmission of ancient Greek mathematical and astronomical knowledge. He edited and arranged Euclid's 'Elements' and wrote commentaries on works by Euclid and Ptolemy.",
    "astrolabe": "An ancient astronomical instrument used for solving problems related to time and the position of the stars. It was widely used in navigation, astronomy, and astrology from antiquity through the Middle Ages.",
    "hydrometer": "An instrument used to measure the specific or relative density of liquids, essentially comparing the liquid's density to that of water.",
    "agora": "In ancient Greece, the agora was a central public space used for assemblies and markets. It served as a gathering place for citizens to discuss politics, philosophy, and social issues, and was often the heart of a city-state.",
    "Mouseion": "In ancient Greece, a Mouseion was a temple or institution dedicated to the Muses, the goddesses of the arts and sciences. The most famous Mouseion was the one in Alexandria, which housed the Library of Alexandria and served as a center for scholarly research and learning.",
    "Orestes": "A Roman state official serving as governor of the diocese of Egypt in 415. During his term of office, he was engaged a violent feud with the bishop of Alexandria, Cyril, and their struggle precipitated the death of the philosopher and scientist Hypatia.",
    "opportunity cost": "The value of the next best alternative that is forgone when making a decision. It represents the benefits that could have been obtained by choosing that alternative instead.",
    "apophatic": "Apophaticism, also known as negative theology, is a way of understanding and speaking about the divine by describing what it is not rather than what it is. It emphasizes the limits of human language and concepts when trying to grasp the infinite or transcendent nature of the divine.",
    "Proclus": "Proclus Lycaeus (412 - 485) was a Greek Neoplatonist philosopher who is considered one of the last major philosophers of the ancient world. He set forth one of the most elaborate and fully developed systems of Neoplatonism and, through later interpreters and translators, exerted an influence on Byzantine philosophy, early Islamic philosophy, scholastic philosophy, and German idealism, especially Hegel.",
    "univocity": "In philosophy, univocity refers to the idea that a term or concept has the same meaning when applied to different subjects. It contrasts with equivocity, where a term has different meanings in different contexts, and analogy, where a term has related but distinct meanings.",
    "metempsychois": "The philosophical concept of the transmigration of the soul, or the belief that the soul can be reborn into a new body after death. It is often associated with various religious and philosophical traditions, including Pythagoreanism and certain forms of Hinduism and Buddhism.",
    "tetractys": "A triangular figure consisting of ten points arranged in four rows: one, two, three, and four points in each row, which is the geometrical representation of the fourth triangular number. As a mystical symbol, it was very important to the secret worship of Pythagoreanism.",
    "Monothelite": "Monothelitism was a 7th-century Christian theological doctrine that asserts Jesus Christ possesses only one will, despite having two distinct natures: divine and human. This view was deemed heretical by the Third Council of Constantinople in 680-681 AD, which affirmed that Christ has two wills, corresponding to his two natures, known as Dyothelitism."
}
